{
"命宫": "代表一个人的性格、天赋和整体命运。",
"父母": "代表父母、长辈关系及遗传影响。",
"福德": "代表福气、精神享受和道德修养。",
"田宅": "代表家庭、不动产和居住环境。",
"官禄": "代表事业、职业和社会地位。",
"仆役": "代表朋友、下属和人际关系。",
"迁移": "代表外出、旅行和外部机遇。",
"疾厄": "代表健康、疾病和身体状况。",
"财帛": "代表财富、金钱和理财能力。",
"子女": "代表子女、晚辈和生育能力。",
"夫妻": "代表婚姻、配偶和感情生活。",
"兄弟": "代表兄弟姐妹、平辈关系。",
"紫微": "凶星吉星：吉星\n斗分：北斗帝星\n阴阳：阴\n五行：土\n化气：尊\n能量：权威、领导力\n职业：政治家、企业家、高级管理者\n职务：皇帝、首领、决策者\n别号：帝星\n解释：紫微星是紫微斗数中的帝星，代表权威、领导力和尊贵。坐命宫时，性格刚强，有领导才能，但易孤独。喜会辅星增强力量，忌会煞星削弱权威。五行属土，化气为尊，象征稳定和包容。在斗分中属于北斗星系，阴性能量，主导事业和地位。适合从事领导、管理或政治职业，但需注意避免傲慢和孤立。",
"天机": "凶星吉星：吉星（但带变动）\n斗分：南斗第一星\n阴阳：阴\n五行：木\n化气：善\n能量：智慧、策划、变动\n职业：策划师、教师、技术员\n职务：谋士、顾问、计划者\n别号：智星\n解释：天机星代表智慧、机智和变动。坐命宫时，聪明灵活，善策划，但多思多虑，易有波折。喜会文星增强智慧，忌会煞星增加不安。五行属木，化气为善，象征生长和变化。在斗分中属于南斗星系，阴性能量，主导思维和沟通。适合从事教育、技术或策划职业，但需注意避免过度忧虑和犹豫。",
"太阳": "凶星吉星：吉星\n斗分：中天星\n阴阳：阳\n五行：火\n化气：贵\n能量：光明、博爱、活力\n职业：教师、医生、公益人士\n职务：光明使者、领导者\n别号：日星\n解释：太阳星代表光明、博爱和父亲。坐命宫时，热情开朗，有领导力，但易冲动。喜会吉星增强光明，忌会煞星导致劳碌。五行属火，化气为贵，象征热情和奉献。在斗分中属于中天星系，阳性能量，主导社会活动和事业。适合从事教育、医疗或公益职业，但需注意避免过度劳累和独断。",
"武曲": "凶星吉星：吉星（但带刚毅）\n斗分：北斗第六星\n阴阳：阴\n五行：金\n化气：财\n能量：财富、决断、行动力\n职业：金融家、军人、工程师\n职务：财星、执行者\n别号：财星\n解释：武曲星代表财富、武勇和决断。坐命宫时，刚毅果断，善理财，但易固执。喜会禄存增强财富，忌会煞星导致破财。五行属金，化气为财，象征坚韧和收获。在斗分中属于北斗星系，阴性能量，主导财富和行动。适合从事金融、军事或技术职业，但需注意避免过于固执和冲动。",
"天同": "凶星吉星：吉星\n斗分：南斗第四星\n阴阳：阳\n五行：水\n化气：福\n能量：温和、享受、人缘\n职业：艺术家、咨询师、服务人员\n职务：福星、协调者\n别号：福星\n解释：天同星代表温和、享受和人缘。坐命宫时，性格温和，爱享受，但易懒散。喜会吉星增强福气，忌会煞星减少安逸。五行属水，化气为福，象征流动和和谐。在斗分中属于南斗星系，阳性能量，主导人际关系和享受。适合从事艺术、咨询或服务职业，但需注意避免懒惰和依赖。",
"廉贞": "凶星吉星：凶星（但带桃花）\n斗分：北斗第五星\n阴阳：阴\n五行：火\n化气：囚\n能量：感情、桃花、正直\n职业：艺术家、律师、公关人员\n职务：桃花星、执法者\n别号：囚星\n解释：廉贞星代表复杂、感情和桃花。坐命宫时，多才多艺，感情丰富，但易有是非。喜会吉星化解桃花，忌会煞星增加纠纷。五行属火，化气为囚，象征束缚和激情。在斗分中属于北斗星系，阴性能量，主导感情和艺术。适合从事艺术、法律或公关职业，但需注意避免感情用事和是非。",
"天府": "凶星吉星：吉星\n斗分：南斗主星\n阴阳：阳\n五行：土\n化气：库\n能量：财富、稳定、保守\n职业：银行家、仓储管理、保守行业\n职务：库星、管理者\n别号：库星\n解释：天府星代表库藏、保守和稳定。坐命宫时，稳重可靠，善积累财富，但易保守。喜会禄存增强库藏，忌会煞星导致破耗。五行属土，化气为库，象征积累和稳定。在斗分中属于南斗星系，阳性能量，主导财富和管理。适合从事金融、管理或保守职业，但需注意避免过于保守和孤立。",
"太阴": "凶星吉星：吉星\n斗分：中天星\n阴阳：阴\n五行：水\n化气：富\n能量：月亮、母亲、直觉\n职业：艺术家、心理学家、夜间工作\n职务：月星、护理者\n别号：月星\n解释：太阴星代表月亮、母亲和财富。坐命宫时，温柔内向，有艺术天赋，但易消极。喜会吉星增强财富，忌会煞星导致情绪不稳。五行属水，化气为富，象征柔和和直觉。在斗分中属于中天星系，阴性能量，主导家庭和艺术。适合从事艺术、心理或夜间职业，但需注意避免消极和情绪化。",
"贪狼": "凶星吉星：凶星（但带桃花）\n斗分：北斗第一星\n阴阳：阳\n五行：木\n化气：桃花\n能量：欲望、桃花、多才多艺\n职业：娱乐业、销售、艺术\n职务：桃花星、欲望星\n别号：狼星\n解释：贪狼星代表欲望、桃花和多才多艺。坐命宫时，欲望强，善交际，但易贪心。喜会吉星转化欲望，忌会煞星增加桃花劫。五行属木，化气为桃花，象征生长和诱惑。在斗分中属于北斗星系，阳性能量，主导欲望和娱乐。适合从事娱乐、销售或艺术职业，但需注意避免贪婪和过度放纵。",
"巨门": "凶星吉星：凶星\n斗分：北斗第二星\n阴阳：阴\n五行：土\n化气：暗\n能量：口舌、是非、沟通\n职业：律师、记者、咨询师\n职务：口舌星、沟通者\n别号：暗星\n解释：巨门星代表口舌、是非和沟通。坐命宫时，口才好，善辩论，但易招惹是非。喜会吉星化解口舌，忌会煞星增加暗害。五行属土，化气为暗，象征隐藏和阻碍。在斗分中属于北斗星系，阴性能量，主导沟通和思考。适合从事法律、媒体或咨询职业，但需注意避免口舌是非和阴谋。",
"天相": "凶星吉星：吉星\n斗分：南斗第五星\n阴阳：阳\n五行：水\n化气：印\n能量：印信、辅助、公正\n职业：秘书、律师、公务员\n职务：印星、辅助者\n别号：印星\n解释：天相星代表印信、辅助和公正。坐命宫时，正直可靠，善辅助他人，但易依赖。喜会吉星增强地位，忌会煞星导致失信。五行属水，化气为印，象征流动和信任。在斗分中属于南斗星系，阳性能量，主导文书和辅助。适合从事文秘、法律或公务职业，但需注意避免过度依赖和失信。",
"天梁": "凶星吉星：吉星\n斗分：南斗第二星\n阴阳：阳\n五行：土\n化气：荫\n能量：荫护、长寿、司法\n职业：医生、法官、宗教人士\n职务：荫星、保护者\n别号：荫星\n解释：天梁星代表荫护、长寿和司法。坐命宫时，稳重善良，有贵人助，但易老成。喜会吉星增强福寿，忌会煞星减少庇护。五行属土，化气为荫，象征稳定和保护。在斗分中属于南斗星系，阳性能量，主导健康和司法。适合从事医疗、法律或宗教职业，但需注意避免过于保守和固执。",
"七杀": "凶星吉星：凶星\n斗分：南斗第六星\n阴阳：阴\n五行：金\n化气：权\n能量：肃杀、冲动、变革\n职业：军人、警察、探险家\n职务：杀星、变革者\n别号：杀星\n解释：七杀星代表肃杀、冲动和变革。坐命宫时，勇敢果断，善开拓，但易冲动。喜会吉星化杀为权，忌会煞星增加风险。五行属金，化气为权，象征锐利和变革。在斗分中属于南斗星系，阴性能量，主导行动和突破。适合从事军事、警察或冒险职业，但需注意避免冲动和破坏。",
"破军": "凶星吉星：凶星\n斗分：北斗第七星\n阴阳：阴\n五行：水\n化气：耗\n能量：破坏、创新、冒险\n职业：工程师、改革家、冒险家\n职务：破星、创新者\n别号：破星\n解释：破军星代表破坏、创新和冒险。坐命宫时，敢于突破，善变化，但易破坏。喜会吉星引导创新，忌会煞星导致损失。五行属水，化气为耗，象征流动和消耗。在斗分中属于北斗星系，阴性能量，主导变革和冒险。适合从事工程、改革或冒险职业，但需注意避免过度破坏和浪费。",
"左辅": "凶星吉星：吉星\n斗分：辅星\n阴阳：阳\n五行：土\n化气：助\n能量：贵人、帮助、支持\n职业：助理、顾问、支持人员\n职务：辅星、帮助者\n别号：左辅星\n解释：左辅星是辅助之星，代表贵人、帮助和支持。坐命宫时，得人助，事业顺，但易依赖。喜会主星增强力量，忌会煞星减少助力。五行属土，化气为助，象征稳定和支持。在斗分中属于辅星系，阳性能量，主导人际关系和辅助。适合从事助理、咨询或支持职业，但需注意避免过度依赖。",
"右弼": "凶星吉星：吉星\n斗分：辅星\n阴阳：阴\n五行：水\n化气：助\n能量：贵人、帮助、协调\n职业：协调员、秘书、调解员\n职务：弼星、协调者\n别号：右弼星\n解释：右弼星是辅助之星，代表贵人、帮助和协调。坐命宫时，人缘好，善协调，但易优柔。喜会主星增强成功，忌会煞星增加犹豫。五行属水，化气为助，象征流动和和谐。在斗分中属于辅星系，阴性能量，主导协调和沟通。适合从事协调、文秘或调解职业，但需注意避免优柔寡断。",
"文昌": "凶星吉星：吉星\n斗分：文星\n阴阳：阳\n五行：金\n化气：科\n能量：文学、才华、考试\n职业：作家、教师、学者\n职务：文星、学者\n别号：文昌星\n解释：文昌星代表文学、才华和考试。坐命宫时，聪明好学，有文采，但易理想化。喜会文星增强才华，忌会煞星导致文途受阻。五行属金，化气为科，象征锐利和智慧。在斗分中属于文星系，阳性能量，主导学习和文化。适合从事文学、教育或研究职业，但需注意避免脱离实际。",
"文曲": "凶星吉星：吉星\n斗分：文星\n阴阳：阴\n五行：水\n化气：科\n能量：艺术、口才、智慧\n职业：艺术家、演说家、设计师\n职务：曲星、艺术家\n别号：文曲星\n解释：文曲星代表艺术、口才和智慧。坐命宫时，多才多艺，善表达，但易浮华。喜会文星增强艺术，忌会煞星减少灵感。五行属水，化气为科，象征流动和创意。在斗分中属于文星系，阴性能量，主导艺术和表达。适合从事艺术、设计或演讲职业，但需注意避免浮夸和虚伪。",
"天魁": "凶星吉星：吉星\n斗分：贵人星\n阴阳：阳\n五行：火\n化气：贵\n能量：男性贵人、机遇、帮助\n职业：领导、顾问、贵人行业\n职务：魁星、贵人\n别号：天魁星\n解释：天魁星是天乙贵人，代表男性贵人、机遇和帮助。坐命宫时，遇难呈祥，得人提携，但易被动。喜会吉星增强贵人运，忌会煞星减少机遇。五行属火，化气为贵，象征热情和机遇。在斗分中属于贵人星系，阳性能量，主导机遇和帮助。适合从事领导、咨询或贵人相关职业，但需注意避免被动等待。",
"天钺": "凶星吉星：吉星\n斗分：贵人星\n阴阳：阴\n五行：火\n化气：贵\n能量：女性贵人、机遇、帮助\n职业：女性行业、护理、教育\n职务：钺星、贵人\n别号：天钺星\n解释：天钺星是天乙贵人，代表女性贵人、机遇和帮助。坐命宫时，得女性助，事业顺，但易依赖。喜会吉星增强贵人运，忌会煞星减少帮助。五行属火，化气为贵，象征温暖和支持。在斗分中属于贵人星系，阴性能量，主导女性贵人和社会关系。适合从事女性相关、护理或教育职业，但需注意避免过度依赖。",
"禄存": "凶星吉星：吉星\n斗分：财星\n阴阳：阴\n五行：土\n化气：禄\n能量：财富、稳定、积累\n职业：金融家、仓储、保守行业\n职务：存星、财星\n别号：禄存星\n解释：禄存星代表财富、稳定和积累。坐命宫时，财运佳，善储蓄，但易保守。喜会主星增强财富，忌会煞星导致破财。五行属土，化气为禄，象征积累和稳定。在斗分中属于财星系，阴性能量，主导财富和储蓄。适合从事金融、仓储或保守职业，但需注意避免过于保守和错过机会。",
"天马": "凶星吉星：中性星\n斗分：动星\n阴阳：阳\n五行：火\n化气：动\n能量：移动、旅行、变化\n职业：运输、旅行、销售\n职务：马星、移动者\n别号：天马星\n解释：天马星代表移动、旅行和变化。坐命宫时，好动多变，善奔波，但易不稳定。喜会禄存增强移动财，忌会煞星导致劳碌。五行属火，化气为动，象征速度和变化。在斗分中属于动星系，阳性能量，主导旅行和变动。适合从事运输、旅游或销售职业，但需注意避免奔波过度和不安定。",
"擎羊": "凶星吉星：凶星\n斗分：煞星\n阴阳：阳\n五行：金\n化气：刑\n能量：冲突、伤害、冲动\n职业：军人、警察、危险行业\n职务：羊星、冲突者\n别号：擎羊星\n解释：擎羊星是煞星，代表冲突、伤害和冲动。坐命宫时，性格刚烈，易有伤灾，但具突破力。喜会吉星化解冲突，忌会主星增加伤害。五行属金，化气为刑，象征锐利和伤害。在斗分中属于煞星系，阳性能量，主导冲突和行动。适合从事军事、警察或危险职业，但需注意避免冲动和伤害。",
"陀罗": "凶星吉星：凶星\n斗分：煞星\n阴阳：阴\n五行：金\n化气：忌\n能量：拖延、纠缠、反复\n职业：研究、持久行业、司法\n职务：罗星、拖延者\n别号：陀罗星\n解释：陀罗星是煞星，代表拖延、纠缠和反复。坐命宫时，做事迟滞，易有烦恼，但具耐力。喜会吉星化解拖延，忌会主星增加阻碍。五行属金，化气为忌，象征阻碍和反复。在斗分中属于煞星系，阴性能量，主导拖延和坚持。适合从事研究、司法或持久性职业，但需注意避免纠缠和浪费时间。",
"火星": "凶星吉星：凶星\n斗分：煞星\n阴阳：阳\n五行：火\n化气：暴\n能量：急躁、意外、活力\n职业：消防员、运动员、紧急行业\n职务：火星、意外者\n别号：火星\n解释：火星是煞星，代表急躁、意外和活力。坐命宫时，性格急躁，易有意外，但具行动力。喜会吉星化解急躁，忌会主星增加风险。五行属火，化气为暴，象征爆发和意外。在斗分中属于煞星系，阳性能量，主导行动和危机。适合从事消防、运动或紧急职业，但需注意避免冲动和事故。",
"铃星": "凶星吉星：凶星\n斗分：煞星\n阴阳：阴\n五行：火\n化气：忧\n能量：阴郁、烦恼、焦虑\n职业：心理咨询、艺术、夜间工作\n职务：铃星、烦恼者\n别号：铃星\n解释：铃星是煞星，代表阴郁、烦恼和焦虑。坐命宫时，内心不安，易有烦恼，但具警觉性。喜会吉星化解烦恼，忌会主星增加焦虑。五行属火，化气为忧，象征隐藏和焦虑。在斗分中属于煞星系，阴性能量，主导情绪和警惕。适合从事心理、艺术或夜间职业，但需注意避免过度忧虑和抑郁。",
"地空": "凶星吉星：凶星\n斗分：煞星\n阴阳：阴\n五行：火\n化气：空\n能量：空灵、损失、不切实际\n职业：艺术家、哲学家、宗教人士\n职务：空星、理想者\n别号：地空星\n解释：地空星是煞星，代表空灵、损失和不切实际。坐命宫时，想法独特，易有破财，但具创造力。喜会吉星转化空灵，忌会主星增加损失。五行属火，化气为空，象征虚幻和损失。在斗分中属于煞星系，阴性能量，主导灵感和理想。适合从事艺术、哲学或宗教职业，但需注意避免脱离实际和损失。",
"地劫": "凶星吉星：凶星\n斗分：煞星\n阴阳：阳\n五行：火\n化气：劫\n能量：劫数、破财、波动\n职业：冒险家、投资家、变革行业\n职务：劫星、波动者\n别号：地劫星\n解释：地劫星是煞星，代表劫数、破财和波动。坐命宫时，运势起伏，易有损失，但具突破性。喜会吉星化解劫数，忌会主星增加波动。五行属火，化气为劫，象征风险和波动。在斗分中属于煞星系，阳性能量，主导变革和风险。适合从事冒险、投资或变革职业，但需注意避免过度冒险和破财。",
"天官": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阳\n五行：土\n化气：官\n能量：官位、职位、地位\n职业：公务员、管理者、官员\n职务：官星、地位者\n别号：天官星\n解释：天官星代表官位、职位和地位。坐命宫时，有管理能力，易得职位，但易虚荣。喜会吉星增强官运，忌会煞星减少地位。五行属土，化气为官，象征稳定和权威。在斗分中属于杂曜系，阳性能量，主导事业和地位。适合从事管理、公务或官方职业，但需注意避免虚荣和腐败。",
"天福": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阳\n五行：土\n化气：福\n能量：福气、享受、好运\n职业：休闲行业、服务人员、福利工作\n职务：福星、享受者\n别号：天福星\n解释：天福星代表福气、享受和好运。坐命宫时，福气深厚，生活安逸，但易懒散。喜会吉星增强福气，忌会煞星减少享受。五行属土，化气为福，象征稳定和幸福。在斗分中属于杂曜系，阳性能量，主导享受和好运。适合从事休闲、服务或福利职业，但需注意避免懒惰和依赖。",
"天虚": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阴\n五行：土\n化气：虚\n能量：虚弱、不实、健康问题\n职业：医疗、护理、心理咨询\n职务：虚星、健康者\n别号：天虚星\n解释：天虚星代表虚弱、不实和健康问题。坐命宫时，体质弱，易有虚病，但具灵性。喜会吉星化解虚弱，忌会煞星增加疾病。五行属土，化气为虚，象征空洞和脆弱。在斗分中属于杂曜系，阴性能量，主导健康和灵性。适合从事医疗、护理或心理职业，但需注意避免健康问题和欺骗。",
"天哭": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阴\n五行：金\n化气：悲\n能量：悲伤、损失、情绪\n职业：心理咨询、艺术、宗教\n职务：哭星、悲伤者\n别号：天哭星\n解释：天哭星代表悲伤、损失和情绪。坐命宫时，多愁善感，易有悲伤事，但具同情心。喜会吉星化解悲伤，忌会煞星增加损失。五行属金，化气为悲，象征锐利和悲伤。在斗分中属于杂曜系，阴性能量，主导情绪和同情。适合从事心理、艺术或宗教职业，但需注意避免过度悲伤和损失。",
"龙池": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阳\n五行：水\n化气：才\n能量：才华、艺术、贵人\n职业：艺术家、设计师、贵人行业\n职务：池星、才华者\n别号：龙池星\n解释：龙池星代表才华、艺术和贵人。坐命宫时，有艺术天赋，得贵人赏，但易高傲。喜会文星增强才华，忌会煞星减少机遇。五行属水，化气为才，象征流动和创意。在斗分中属于杂曜系，阳性能量，主导艺术和贵人。适合从事艺术、设计或贵人相关职业，但需注意避免高傲和孤立。",
"凤阁": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阴\n五行：土\n化气：美\n能量：艺术、审美、优雅\n职业：设计师、艺术家、美容行业\n职务：阁星、审美者\n别号：凤阁星\n解释：凤阁星代表艺术、审美和优雅。坐命宫时，品味高，善装饰，但易浮华。喜会文星增强艺术，忌会煞星减少美感。五行属土，化气为美，象征稳定和美丽。在斗分中属于杂曜系，阴性能量，主导审美和艺术。适合从事设计、艺术或美容职业，但需注意避免浮华和虚荣。",
"红鸾": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阴\n五行：水\n化气：喜\n能量：婚姻、喜庆、感情\n职业：婚庆行业、艺术、娱乐\n职务：鸾星、喜庆者\n别号：红鸾星\n解释：红鸾星代表婚姻、喜庆和感情。坐命宫时，异性缘佳，易有喜事，但易早恋。喜会吉星增强婚姻，忌会煞星导致感情波折。五行属水，化气为喜，象征流动和喜悦。在斗分中属于杂曜系，阴性能量，主导感情和喜庆。适合从事婚庆、娱乐或艺术职业，但需注意避免感情用事和早婚。",
"天喜": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阳\n五行：水\n化气：喜\n能量：喜悦、好事、生育\n职业：婚庆行业、儿科、娱乐\n职务：喜星、快乐者\n别号：天喜星\n解释：天喜星代表喜悦、好事和生育。坐命宫时，心情愉快，易有好事，但易冲动。喜会吉星增强喜庆，忌会煞星减少快乐。五行属水，化气为喜，象征流动和欢乐。在斗分中属于杂曜系，阳性能量，主导喜悦和生育。适合从事婚庆、儿科或娱乐职业，但需注意避免冲动和过度乐观。",
"孤辰": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阴\n五行：土\n化气：孤\n能量：孤独、独立、冷淡\n职业：研究、独立工作、宗教\n职务：孤星、独立者\n别号：孤辰星\n解释：孤辰星代表孤独、独立和冷淡。坐命宫时，性格孤僻，喜独处，但易寂寞。喜会吉星化解孤独，忌会煞星增加隔离。五行属土，化气为孤，象征稳定和孤立。在斗分中属于杂曜系，阴性能量，主导独立和思考。适合从事研究、独立或宗教职业，但需注意避免孤独和冷漠。",
"寡宿": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阳\n五行：土\n化气：寡\n能量：孤寡、分离、独身\n职业：独立工作、研究、司法\n职务：宿星、独身者\n别号：寡宿星\n解释：寡宿星代表孤寡、分离和独身。坐命宫时，婚姻迟，易分离，但具独立性。喜会吉星化解孤寡，忌会煞星增加孤独。五行属土，化气为寡，象征稳定和分离。在斗分中属于杂曜系，阳性能量，主导独立和分离。适合从事独立、研究或司法职业，但需注意避免孤独和分离。",
"天刑": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阳\n五行：火\n化气：刑\n能量：纪律、法律和惩罚\n职业：法律、警察、纪律行业\n职务：刑星、执法者\n别号：天刑星\n解释：天刑星代表纪律、法律和惩罚。坐命宫时，正直严厉，易涉法律，但具正义感。喜会吉星增强纪律，忌会煞星导致官司。五行属火，化气为刑，象征严厉和惩罚。在斗分中属于杂曜系，阳性能量，主导法律和纪律。适合从事法律、警察或纪律职业，但需注意避免冲突和官司。",
"天姚": "凶星吉星：凶星（带桃花）\n斗分：杂曜\n阴阳：阴\n五行：水\n化气：姚\n能量：桃花、魅力和感情\n职业：娱乐业、艺术、社交\n职务：姚星、魅力者\n别号：天姚星\n解释：天姚星代表桃花、魅力和感情。坐命宫时，风情万种，易有艳遇，但易滥情。喜会吉星转化魅力，忌会煞星导致感情纠纷。五行属水，化气为姚，象征流动和魅力。在斗分中属于杂曜系，阴性能量，主导感情和社交。适合从事娱乐、艺术或社交职业，但需注意避免滥情和纠纷。",
"解神": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阳\n五行：木\n化气：解\n能量：解厄、化解和 缓解\n职业：医疗、咨询、化解行业\n职务：解星、化解者\n别号：解神星\n解释：解神星代表解厄、化解和 缓解。坐命宫时，逢凶化吉，易解困难，但易依赖。喜会吉星增强化解力，忌会煞星减少帮助。五行属木，化气为解，象征生长和化解。在斗分中属于杂曜系，阳性能量，主导解厄和帮助。适合从事医疗、咨询或化解职业，但需注意避免依赖和被动。",
"天巫": "凶星吉星：中性星\n斗分：杂曜\n阴阳：阴\n五行：土\n化气：巫\n能量：神秘、宗教和医术\n职业：宗教、医术、神秘学\n职务：巫星、神秘者\n别号：天巫星\n解释：天巫星代表神秘、宗教和医术。坐命宫时，有神秘倾向，善医术，但易迷信。喜会吉星增强神秘力，忌会煞星减少灵性。五行属土，化气为巫，象征稳定和神秘。在斗分中属于杂曜系，阴性能量，主导宗教和医术。适合从事宗教、医疗或神秘职业，但需注意避免迷信和欺骗。",
"天月": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阴\n五行：水\n化气：月\n能量：疾病、健康和阴柔\n职业：医疗、护理、女性行业\n职务：月星、健康者\n别号：天月星\n解释：天月星代表疾病、健康和阴柔。坐命宫时，体质敏感，易有病痛，但具直觉。喜会吉星化解疾病，忌会煞星增加健康问题。五行属水，化气为月，象征柔和和疾病。在斗分中属于杂曜系，阴性能量，主导健康和直觉。适合从事医疗、护理或女性职业，但需注意避免健康问题和情绪化。",
"阴煞": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阴\n五行：土\n化气：煞\n能量：阴邪、小人和疾病\n职业：安全行业、司法、医疗\n职务：煞星、小人者\n别号：阴煞星\n解释：阴煞星代表阴邪、小人和疾病。坐命宫时，易遇小人，有暗病，但具洞察力。喜会吉星化解阴邪，忌会煞星增加暗害。五行属土，化气为煞，象征隐藏和邪恶。在斗分中属于杂曜系，阴性能量，主导小人和疾病。适合从事安全、司法或医疗职业，但需注意避免暗害和阴谋。",
"三台": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阳\n五行：土\n化气：台\n能量：地位、荣誉和辅助\n职业：管理、荣誉行业、辅助工作\n职务：台星、荣誉者\n别号：三台星\n解释：三台星代表地位、荣誉和辅助。坐命宫时，有社会地位，易得荣誉，但易虚荣。喜会吉星增强地位，忌会煞星减少荣誉。五行属土，化气为台，象征稳定和荣誉。在斗分中属于杂曜系，阳性能量，主导地位和辅助。适合从事管理、荣誉或辅助职业，但需注意避免虚荣和骄傲。",
"八座": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阴\n五行：土\n化气：座\n能量：地位、辅助和支持\n职业：管理、支持行业、公共服务\n职务：座星、支持者\n别号：八座星\n解释：八座星代表地位、辅助和支持。坐命宫时，得人拥护，易升迁，但易依赖。喜会吉星增强支持，忌会煞星减少助力。五行属土，化气为座，象征稳定和支持。在斗分中属于杂曜系，阴性能量，主导地位和支持。适合从事管理、支持或公共服务职业，但需注意避免依赖和失去自主。",
"恩光": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阳\n五行：火\n化气：光\n能量：恩惠、光彩和贵人\n职业：公关、荣誉行业、贵人工作\n职务：光星、恩惠者\n别号：恩光星\n解释：恩光星代表恩惠、光彩和贵人。坐命宫时，得人恩惠，易有光彩，但易骄傲。喜会吉星增强恩惠，忌会煞星减少光彩。五行属火，化气为光，象征热情和光彩。在斗分中属于杂曜系，阳性能量，主导恩惠和贵人。适合从事公关、荣誉或贵人相关职业，但需注意避免骄傲和失信。",
"天贵": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阴\n五行：土\n化气：贵\n能量：高贵、地位和贵人\n职业：领导、贵族行业、高级管理\n职务：贵星、高贵者\n别号：天贵星\n解释：天贵星代表高贵、地位和贵人。坐命宫时，气质高贵，易得贵人，但易自负。喜会吉星增强高贵，忌会煞星减少贵人运。五行属土，化气为贵，象征稳定和高贵。在斗分中属于杂曜系，阴性能量，主导地位和贵人。适合从事领导、高级管理或贵族职业，但需注意避免自负和孤立。",
"天才": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阳\n五行：木\n化气：才\n能量：智慧、才华和能力\n职业：教育、技术、研究\n职务：才星、智慧者\n别号：天才星\n解释：天才星代表智慧、才华和能力。坐命宫时，聪明过人，有专长，但易偏执。喜会文星增强才华，忌会煞星减少智慧。五行属木，化气为才，象征生长和智慧。在斗分中属于杂曜系，阳性能量，主导才华和能力。适合从事教育、技术或研究职业，但需注意避免偏执和骄傲。",
"天寿": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阴\n五行：土\n化气：寿\n能量：长寿、健康和稳定\n职业：医疗、养生、老年服务\n职务：寿星、健康者\n别号：天寿星\n解释：天寿星代表长寿、健康和稳定。坐命宫时，寿命长，健康佳，但易保守。喜会吉星增强健康，忌会煞星减少稳定。五行属土，化气为寿，象征稳定和长寿。在斗分中属于杂曜系，阴性能量，主导健康和稳定。适合从事医疗、养生或老年服务职业，但需注意避免保守和停滞。",
"破碎": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阳\n五行：金\n化气：碎\n能量：破坏、分离和不完整\n职业：改革、破坏行业、司法\n职务：碎星、破坏者\n别号：破碎星\n解释：破碎星代表破坏、分离和不完整。坐命宫时，易有破碎事，但具重建力。喜会吉星化解破坏，忌会煞星增加分离。五行属金，化气为碎，象征锐利和破坏。在斗分中属于杂曜系，阳性能量，主导破坏和重建。适合从事改革、破坏或司法职业，但需注意避免过度破坏和分离。",
"蜚廉": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阴\n五行：火\n化气：廉\n能量：是非、谣言和小人\n职业：公关、法律、媒体\n职务：廉星、是非者\n别号：蜚廉星\n解释：蜚廉星代表是非、谣言和小人。坐命宫时，易惹是非，有谣言，但具辨别力。喜会吉星化解是非，忌会煞星增加谣言。五行属火，化气为廉，象征隐藏和是非。在斗分中属于杂曜系，阴性能量，主导是非和谣言。适合从事公关、法律或媒体职业，但需注意避免是非和诽谤。",
"天空": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阳\n五行：火\n化气：空\n能量：空灵、理想和损失\n职业：艺术、哲学、宗教\n职务：空星、理想者\n别号：天空星\n解释：天空星代表空灵、理想和损失。坐命宫时，想法空幻，易有损失，但具灵感。喜会吉星转化空灵，忌会煞星增加理想化。五行属火，化气为空，象征虚幻和损失。在斗分中属于杂曜系，阳性能量，主导灵感和理想。适合从事艺术、哲学或宗教职业，但需注意避免脱离实际和损失。",
"台辅": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阳\n五行：土\n化气：辅\n能量：辅助、支持和服务\n职业：助理、服务行业、支持工作\n职务：辅星、服务者\n别号：台辅星\n解释：台辅星代表辅助、支持和服务。坐命宫时，善辅助他人，易得支持，但易卑微。喜会吉星增强辅助，忌会煞星减少服务。五行属土，化气为辅，象征稳定和支持。在斗分中属于杂曜系，阳性能量，主导辅助和服务。适合从事助理、服务或支持职业，但需注意避免卑微和失去自我。",
"封诰": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阴\n五行：土\n化气：诰\n能量：荣誉、封赏和地位\n职业：荣誉行业、管理、官方工作\n职务：诰星、荣誉者\n别号：封诰星\n解释：封诰星代表荣誉、封赏和地位。坐命宫时，易得表彰，有荣誉，但易虚荣。喜会吉星增强封赏，忌会煞星减少荣誉。五行属土，化气为诰，象征稳定和荣誉。在斗分中属于杂曜系，阴性能量，主导荣誉和地位。适合从事荣誉、管理或官方职业，但需注意避免虚荣和骄傲。",
"年解": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阳\n五行：木\n化气：解\n能量：解厄、化解困难\n职业：医疗、咨询、化解行业\n职务：解星、化解者\n别号：年解星\n解释：年解星代表解厄、化解困难。坐命宫时，能化解年灾，但易依赖。喜会吉星增强解厄，忌会煞星减少化解力。五行属木，化气为解，象征生长和化解。在斗分中属于杂曜系，阳性能量，主导解厄和帮助。适合从事医疗、咨询或化解职业，但需注意避免依赖和被动。",
"空亡": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阴\n五行：火\n化气：空\n能量：空虚、失败、无用\n职业：哲学、宗教、玄学\n职务：空亡、虚无者\n别号：空亡星\n解释：空亡星代表空虚、失败和无用。坐命宫时，想法空幻，易有落空之事，做事往往徒劳无功，但具超脱世俗的智慧。喜会吉星转化空性，忌会煞星增加损失。五行属火，化气为空，象征虚幻和消亡。在斗分中属于杂曜系，阴性能量，主导空虚和超脱。适合从事哲学、宗教或玄学等需要超然心态的职业，但需注意避免一事无成和脱离现实。",
"天厨": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阳\n五行：土\n化气：厨\n能量：饮食、福气、享受\n职业：餐饮、美食、营养行业\n职务：天厨、食神者\n别号：天厨星\n解释：天厨星代表饮食、福气和享受。坐命宫时，有口福，善品味，生活享受丰富，但易贪图口腹之欲。喜会吉星增强福气，忌会煞星导致饮食无度。五行属土，化气为厨，象征滋养和积累。在斗分中属于杂曜系，阳性能量，主导饮食和享受。适合从事餐饮、美食或营养相关职业，但需注意避免过度享受和肥胖问题。",
"月德": "凶星吉星：吉星\n斗分：杂曜\n阴阳：阴\n五行：木\n化气：德\n能量：道德、解厄、阴德\n职业：公益、慈善、女性行业\n职务：月德、阴德者\n别号：月德星\n解释：月德星代表道德、解厄和阴德。坐命宫时，心地善良，有暗中的福德，易得女性贵人相助，但易过于理想化。喜会吉星增强阴德，忌会煞星减少庇护。五行属木，化气为德，象征生长和阴柔之德。在斗分中属于杂曜，流动属性，阴性能量，主导流年中的阴德和女性贵人。适合从事公益、慈善或女性相关职业，但需注意避免理想化和被动等待。",
"天伤": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阳\n五行：金\n化气：伤\n能量：伤害、损失、疾病\n职业：医疗、康复、保险行业\n职务：天伤、伤害者\n别号：天伤星\n解释：天伤星代表伤害、损失和疾病。坐命宫时，易受外伤或疾病困扰，人生易有损伤之事，但具坚强的抗压能力。喜会吉星化解伤害，忌会煞星加重损伤。五行属金，化气为伤，象征锐利和伤害。在斗分中属于杂曜，固定属性，阳性能量，主导伤害和抗压。适合从事医疗、康复或保险等处理伤害的职业，但需注意避免意外伤害和疾病困扰。",
"天使": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阴\n五行：水\n化气：使\n能量：灾厄、疾病、负面信息\n职业：医疗、殡葬、心理咨询\n职务：天使、灾厄者\n别号：天使星\n解释：天使星代表灾厄、疾病和负面信息。坐命宫时，易接收不好的消息，健康方面需要特别注意，但具预知和防范能力。喜会吉星化解灾厄，忌会煞星增加负面信息。五行属水，化气为使，象征流动和传递。在斗分中属于杂曜，固定属性，阴性能量，主导灾厄和预警。适合从事医疗、殡葬或心理咨询等处理负面信息的职业，但需注意避免被负面能量影响。",
"旬空": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阳\n五行：火\n化气：空\n能量：空虚、损失、无用\n职业：玄学、哲学、研究\n职务：旬空、虚无者\n别号：旬空星\n解释：旬空星代表空虚、损失和无用。坐命宫时，做事易成空，计划难落实，常有徒劳之感，但具看透本质的智慧。喜会吉星转化空性，忌会煞星增加损失。五行属火，化气为空，象征虚幻和落空。在斗分中属于杂曜系，阳性能量，主导空虚和洞察。适合从事玄学、哲学或研究等需要空灵心态的职业，但需注意避免一事无成和脱离实际。",
"截空": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阴\n五行：火\n化气：截\n能量：中断、阻碍、落空\n职业：策划、研究、玄学\n职务：截空、中断者\n别号：截空星\n解释：截空星代表中断、阻碍和落空。坐命宫时，事情易中途而废，计划常遭打断，但具应变和调整能力。喜会吉星化解中断，忌会煞星增加阻碍。五行属火，化气为截，象征截断和阻碍。在斗分中属于杂曜系，阴性能量，主导中断和应变。适合从事策划、研究或玄学等需要灵活性的职业，但需注意避免半途而废和计划落空。",
"大耗": "凶星吉星：凶星\n斗分：博士十二神（固定）\n阴阳：阳\n五行：火\n化气：耗\n能量：大损失、破财和消耗\n职业：金融、保险、风险管理\n职务：大耗、损失者\n别号：大耗星\n解释：大耗星代表大损失、破财和消耗。坐命宫时，易有大破财，但具警示性。喜会吉星化解损失，忌会煞星增加消耗。五行属火，化气为耗，象征爆发和损失。在斗分中属于博士十二神，固定属性，阳性能量，主导大损失和消耗。适合从事金融、保险或风险管理职业，但需注意避免破财和浪费。\n岁前12神（流动）：象征大损失、破财和消耗。坐命宫时，易有大破财，但具警示性。喜会吉星化解损失，忌会煞星增加消耗。五行属火，化气为耗，流动属性，主导流年中的大损失。\n凶星吉星：凶星\n斗分：杂曜\n阴阳：阳\n五行：火\n化气：耗\n能量：大损失、破财和消耗\n职业：金融、保险、风险管理\n职务：耗星、损失者\n别号：大耗星\n解释：大耗星代表大损失、破财和消耗。坐命宫时，易有大破财，但具警示性。喜会吉星化解损失，忌会煞星增加消耗。五行属火，化气为耗，象征爆发和损失。在斗分中属于杂曜系，阳性能量，主导损失和风险。适合从事金融、保险或风险管理职业，但需注意避免破财和浪费。",
"伏兵": "凶星吉星：凶星\n斗分：杂曜\n阴阳：阴\n五行：水\n化气：伏\n能量：隐藏、陷阱和小人\n职业：安全、司法、侦查\n职务：兵星、隐藏者\n别号：伏兵星\n解释：伏兵星代表隐藏、陷阱和小人。坐命宫时，易遇暗算，但具警惕性。喜会吉星化解陷阱，忌会煞星增加隐藏风险。五行属水，化气为伏，象征流动和隐藏。在斗分中属于杂曜系，阴性能量，主导陷阱和小人。适合从事安全、司法或侦查职业，但需注意避免暗算和阴谋。",
"博士": "凶星吉星：吉星\n斗分：博士十二神（固定）\n阴阳：阳\n五行：木\n化气：博\n能量：智慧、学习和文化\n职业：教育、研究、文化行业\n职务：博士、学者\n别号：博士星\n解释：博士星代表智慧、学习和文化。坐命宫时，好学聪明，有学识，但易书呆。喜会文星增强学习，忌会煞星减少智慧。五行属木，化气为博，象征生长和智慧。在斗分中属于博士十二神，固定属性，阳性能量，主导学习和文化。适合从事教育、研究或文化职业，但需注意避免脱离实际。",
"力士": "凶星吉星：吉星\n斗分：博士十二神（固定）\n阴阳：阳\n五行：火\n化气：力\n能量：力量、努力和帮助\n职业：体力工作、运动、帮助行业\n职务：力士、努力者\n别号：力士星\n解释：力士星代表力量、努力和帮助。坐命宫时，体力佳，善努力，但易劳累。喜会吉星增强力量，忌会煞星导致徒劳。五行属火，化气为力，象征热情和努力。在斗分中属于博士十二神，固定属性，阳性能量，主导力量和帮助。适合从事体力、运动或帮助职业，但需注意避免劳累和徒劳。",
"青龙": "凶星吉星：吉星\n斗分：博士十二神（固定）\n阴阳：阳\n五行：木\n化气：青\n能量：喜庆、吉祥和贵人\n职业：喜庆行业、公关、贵人工作\n职务：青龙、喜庆者\n别号：青龙星\n解释：青龙星代表喜庆、吉祥和贵人。坐命宫时，易有喜事，得贵人，但易浮夸。喜会吉星增强喜庆，忌会煞星减少吉祥。五行属木，化气为青，象征生长和喜庆。在斗分中属于博士十二神，固定属性，阳性能量，主导喜庆和贵人。适合从事喜庆、公关或贵人相关职业，但需注意避免浮夸和失信。",
"小耗": "凶星吉星：凶星\n斗分：博士十二神（固定）\n阴阳：阴\n五行：火\n化气：耗\n能量：小损失、破财和浪费\n职业：财务、节俭行业、管理\n职务：小耗、损失者\n别号：小耗星\n解释：小耗星代表小损失、破财和浪费。坐命宫时，易有小破财，但具节俭意识。喜会吉星化解损失，忌会煞星增加浪费。五行属火，化气为耗，象征消耗和损失。在斗分中属于博士十二神，固定属性，阴性能量，主导小损失和浪费。适合从事财务、管理或节俭职业，但需注意避免浪费和破财。\n岁前12神（流动）：象征小损失、破财和浪费。坐命宫时，易有小破财，但具节俭意识。喜会吉星化解损失，忌会煞星增加浪费。五行属火，化气为耗，流动属性，主导流年中的小损失。",
"将军": "凶星吉星：吉星\n斗分：博士十二神（固定）\n阴阳：阳\n五行：金\n化气：将\n能量：权威、军事和决断\n职业：军事、领导、决断行业\n职务：将军、权威者\n别号：将军星\n解释：将军星代表权威、军事和决断。坐命宫时，有决断力，易掌兵权，但易暴力。喜会吉星增强权威，忌会煞星导致冲突。五行属金，化气为将，象征锐利和权威。在斗分中属于博士十二神，固定属性，阳性能量，主导权威和军事。适合从事军事、领导或决断职业，但需注意避免暴力和冲突。",
"奏书": "凶星吉星：吉星\n斗分：博士十二神（固定）\n阴阳：阴\n五行：水\n化气：奏\n能量：文书、沟通和消息\n职业：文书、沟通、媒体行业\n职务：奏书、沟通者\n别号：奏书星\n解释：奏书星代表文书、沟通和消息。坐命宫时，善沟通，易得消息，但易轻信。喜会文星增强文书，忌会煞星减少沟通。五行属水，化气为奏，象征流动和沟通。在斗分中属于博士十二神，固定属性，阴性能量，主导文书和消息。适合从事文书、媒体或沟通职业，但需注意避免轻信和误传。",
"飞廉": "凶星吉星：凶星\n斗分：博士十二神（固定）\n阴阳：阳\n五行：火\n化气：飞\n能量：是非、谣言和小人\n职业：公关、法律、媒体\n职务：飞廉、是非者\n别号：飞廉星\n解释：飞廉星代表是非、谣言和小人。坐命宫时，易惹口舌，有谣言，但具反击力。喜会吉星化解是非，忌会煞星增加谣言。五行属火，化气为飞，象征爆发和是非。在斗分中属于博士十二神，固定属性，阳性能量，主导是非和谣言。适合从事公关、法律或媒体职业，但需注意避免口舌和诽谤。",
"喜神": "凶星吉星：吉星\n斗分：博士十二神（固定）\n阴阳：阳\n五行：木\n化气：喜\n能量：喜庆、快乐和好事\n职业：喜庆行业、娱乐、心理\n职务：喜神、快乐者\n别号：喜神星\n解释：喜神星代表喜庆、快乐和好事。坐命宫时，心情愉快，易有好事，但易过度乐观。喜会吉星增强喜庆，忌会煞星减少快乐。五行属木，化气为喜，象征生长和快乐。在斗分中属于博士十二神，固定属性，阳性能量，主导喜庆和好事。适合从事喜庆、娱乐或心理职业，但需注意避免过度乐观和失望。",
"病符": "凶星吉星：凶星\n斗分：博士十二神（固定）\n阴阳：阴\n五行：水\n化气：病\n能量：疾病、健康问题\n职业：医疗、护理、健康行业\n职务：病符、健康者\n别号：病符星\n解释：病符星代表疾病、健康问题。坐命宫时，易有病痛，但具保健意识。喜会吉星化解疾病，忌会煞星增加健康问题。五行属水，化气为病，象征流动和疾病。在斗分中属于博士十二神，固定属性，阴性能量，主导疾病和健康。适合从事医疗、护理或健康职业，但需注意避免病痛和忽视健康。\n岁前12神（流动）：象征疾病、健康问题。坐命宫时，易有病痛，但具保健意识。喜会吉星化解疾病，忌会煞星增加健康问题。五行属水，化气为病，流动属性，主导流年中的健康问题。",
"官府": "凶星吉星：凶星\n斗分：博士十二神（固定）\n阴阳：阳\n五行：金\n化气：府\n能量：官非、法律和纪律\n职业：法律、公务员、纪律行业\n职务：官府、官非者\n别号：官府星\n解释：官府星代表官非、法律和纪律。坐命宫时，易涉官司，但具法律意识。喜会吉星化解官非，忌会煞星增加法律问题。五行属金，化气为府，象征锐利和官非。在斗分中属于博士十二神，固定属性，阳性能量，主导法律和纪律。适合从事法律、公务或纪律职业，但需注意避免官司和冲突。",
"将星": "凶星吉星：吉星\n斗分：将前12神（流动）\n阴阳：阳\n五行：火\n化气：将\n能量：领导、权威和能力\n职业：领导、管理、军事\n职务：将星、领导者\n别号：将星\n解释：将星代表领导、权威和能力。坐命宫时，有领导力，易掌权，但易霸道。喜会吉星增强权威，忌会煞星减少控制。五行属火，化气为将，象征热情和权威。在斗分中属于将前12神，流动属性，阳性能量，主导流年中的领导和权力。适合从事管理、军事或领导职业，但需注意避免霸道和独裁。",
"攀鞍": "凶星吉星：吉星\n斗分：将前12神（流动）\n阴阳：阳\n五行：土\n化气：鞍\n能量：努力、晋升和旅行\n职业：旅行行业、销售、晋升工作\n职务：攀鞍、努力者\n别号：攀鞍星\n解释：攀鞍星代表努力、晋升和旅行。坐命宫时，积极进取，易升迁，但易劳累。喜会吉星增强努力，忌会煞星导致徒劳。五行属土，化气为鞍，象征稳定和努力。在斗分中属于将前12神，流动属性，阳性能量，主导流年中的努力和旅行。适合从事旅行、销售或晋升相关职业，但需注意避免劳累和徒劳。",
"岁驿": "凶星吉星：中性星\n斗分：将前12神（流动）\n阴阳：阳\n五行：火\n化气：驿\n能量：旅行、移动和变化\n职业：运输、旅行、变动行业\n职务：岁驿、旅行者\n别号：岁驿星\n解释：岁驿星代表旅行、移动和变化。坐命宫时，好动多变，易远行，但易不稳定。喜会天马增强移动，忌会煞星导致奔波。五行属火，化气为驿，象征速度和变化。在斗分中属于将前12神，流动属性，阳性能量，主导流年中的旅行和变动。适合从事运输、旅游或变动性职业，但需注意避免奔波和不安。",
"息神": "凶星吉星：凶星\n斗分：将前12神（流动）\n阴阳：阴\n五行：土\n化气：息\n能量：休息、停滞和安静\n职业：休闲行业、医疗、静养\n职务：息神、休息者\n别号：息神星\n解释：息神星代表休息、停滞和安静。坐命宫时，喜静厌动，易懒散，但具修养。喜会吉星化解停滞，忌会煞星增加惰性。五行属土，化气为息，象征稳定和静止。在斗分中属于将前12神，流动属性，阴性能量，主导流年中的休息和静养。适合从事休闲、医疗或静养职业，但需注意避免懒惰和停滞。",
"华盖": "凶星吉星：中性星\n斗分：将前12神（流动）\n阴阳：阴\n五行：土\n化气：盖\n能量：艺术、宗教和孤独\n职业：艺术、宗教、研究\n职务：华盖、艺术者\n别号：华盖星\n解释：华盖星代表艺术、宗教和孤独。坐命宫时，有艺术天赋，喜神秘，但易孤芳自赏。喜会文星增强艺术，忌会煞星增加孤独。五行属土，化气为盖，象征覆盖和孤独。在斗分中属于将前12神，流动属性，阴性能量，主导流年中的艺术和宗教。适合从事艺术、宗教或研究职业，但需注意避免孤独和自闭。",
"劫煞": "凶星吉星：凶星\n斗分：将前12神（流动）\n阴阳：阳\n五行：火\n化气：劫\n能量：劫数、损失和灾难\n职业：保险、安全行业、司法\n职务：劫煞、灾难者\n别号：劫煞星\n解释：劫煞星代表劫数、损失和灾难。坐命宫时，易有意外损失，但具警觉性。喜会吉星化解劫数，忌会煞星增加灾难。五行属火，化气为劫，象征风险和损失。在斗分中属于将前12神，流动属性，阳性能量，主导流年中的风险和损失。适合从事保险、安全或司法职业，但需注意避免冒险和损失。",
"灾煞": "凶星吉星：凶星\n斗分：将前12神（流动）\n阴阳：阴\n五行：火\n化气：灾\n能量：灾祸、困难和意外\n职业：应急行业、医疗、安全\n职务：灾煞、困难者\n别号：灾煞星\n解释：灾煞星代表灾祸、困难和意外。坐命宫时，易有灾病，但具抵抗力。喜会吉星化解灾祸，忌会煞星增加困难。五行属火，化气为灾，象征突发和困难。在斗分中属于将前12神，流动属性，阴性能量，主导流年中的危机和困难。适合从事应急、医疗或安全职业，但需注意避免危险和疾病。",
"天煞": "凶星吉星：凶星\n斗分：将前12神（流动）\n阴阳：阳\n五行：金\n化气：天\n能量：天灾、父亲、上级\n职业：领导、父亲行业、灾难管理\n职务：天煞、上级者\n别号：天煞星\n解释：天煞星代表天灾、父亲和上级。坐命宫时，易与父亲不利，但具威严。喜会吉星化解天灾，忌会煞星增加冲突。五行属金，化气为天，象征权威和灾难。在斗分中属于将前12神，流动属性，阳性能量，主导流年中的父亲和上级关系。适合从事领导、管理或灾难应对职业，但需注意避免冲突和灾难。",
"指背": "凶星吉星：凶星\n斗分：将前12神（流动）\n阴阳：阴\n五行：土\n化气：背\n能量：诽谤、小人和是非\n职业：公关、法律、咨询\n职务：指背、是非者\n别号：指背星\n解释：指背星代表诽谤、小人和是非。坐命宫时，易遭人议论，但具忍耐力。喜会吉星化解是非，忌会煞星增加诽谤。五行属土，化气为背，象征隐藏和是非。在斗分中属于将前12神，流动属性，阴性能量，主导流年中的是非和诽谤。适合从事公关、法律或咨询职业，但需注意避免是非和诽谤。",
"咸池": "凶星吉星：凶星（带桃花）\n斗分：将前12神（流动）\n阴阳：阴\n五行：水\n化气：桃\n能量：桃花、欲望和感情\n职业：娱乐业、艺术、社交\n职务：咸池、桃花者\n别号：咸池星\n解释：咸池星代表桃花、欲望和感情。坐命宫时，异性缘旺，易有桃花，但易沉迷。喜会吉星转化桃花，忌会煞星导致桃花劫。五行属水，化气为桃，象征流动和欲望。在斗分中属于将前12神，流动属性，阴性能量，主导流年中的感情和桃花。适合从事娱乐、艺术或社交职业，但需注意避免沉迷和感情纠纷。",
"月煞": "凶星吉星：凶星\n斗分：将前12神（流动）\n阴阳：阴\n五行：水\n化气：月\n能量：女性、母亲和家庭\n职业：女性行业、护理、家庭服务\n职务：月煞、女性者\n别号：月煞星\n解释：月煞星代表女性、母亲和家庭。坐命宫时，易与母亲不利，但具感性。喜会吉星化解女性问题，忌会煞星增加家庭纠纷。五行属水，化气为月，象征柔和和家庭。在斗分中属于将前12神，流动属性，阴性能量，主导流年中的女性和家庭关系。适合从事女性相关、护理或家庭服务职业，但需注意避免家庭冲突和情绪化。",
"亡神": "凶星吉星：凶星\n斗分：将前12神（流动）\n阴阳：阳\n五行：火\n化气：亡\n能量：损失、遗忘和消失\n职业：保险、法律、研究\n职务：亡神、损失者\n别号：亡神星\n解释：亡神星代表损失、遗忘和消失。坐命宫时，易有遗失事，但具反思力。喜会吉星化解损失，忌会煞星增加遗忘。五行属火，化气为亡，象征消失和损失。在斗分中属于将前12神，流动属性，阳性能量，主导流年中的损失和反思。适合从事保险、法律或研究职业，但需注意避免损失和遗忘。",
"岁建": "凶星吉星：中性星\n斗分：岁前12神（流动）\n阴阳：阳\n五行：木\n化气：建\n能量：当年运势、基础\n职业：所有行业、基础工作\n职务：岁建、运势者\n别号：岁建星\n解释：岁建星代表当年运势、基础。坐命宫时，影响当年运，但具变化性。喜会吉星增强运势，忌会煞星导致波动。五行属木，化气为建，象征生长和基础。在斗分中属于岁前12神，流动属性，阳性能量，主导流年中的整体运势。适合从事所有职业，但需注意把握时机和避免波动。",
"晦气": "凶星吉星：凶星\n斗分：岁前12神（流动）\n阴阳：阴\n五行：土\n化气：晦\n能量：倒霉、不顺和阻碍\n职业：所有行业、化解行业\n职务：晦气、阻碍者\n别号：晦气星\n解释：晦气星代表倒霉、不顺和阻碍。坐命宫时，易遇倒霉事，但具忍耐力。喜会吉星化解不顺，忌会煞星增加阻碍。五行属土，化气为晦，象征稳定和阻碍。在斗分中属于岁前12神，流动属性，阴性能量，主导流年中的不顺和阻碍。适合从事所有职业，但需注意耐心和化解困难。",
"丧门": "凶星吉星：凶星\n斗分：岁前12神（流动）\n阴阳：阴\n五行：金\n化气：丧\n能量：丧事、悲伤和损失\n职业：殡葬、心理咨询、宗教\n职务：丧门、悲伤者\n别号：丧门星\n解释：丧门星代表丧事、悲伤和损失。坐命宫时，易有丧事，但具坚强。喜会吉星化解悲伤，忌会煞星增加损失。五行属金，化气为丧，象征锐利和悲伤。在斗分中属于岁前12神，流动属性，阴性能量，主导流年中的悲伤和损失。适合从事殡葬、心理或宗教职业，但需注意避免过度悲伤和损失。",
"贯索": "凶星吉星：凶星\n斗分：岁前12神（流动）\n阴阳：阳\n五行：火\n化气：索\n能量：束缚、官司和困难\n职业：法律、司法、束缚行业\n职务：贯索、束缚者\n别号：贯索星\n解释：贯索星代表束缚、官司和困难。坐命宫时，易受束缚，有官司，但具解脱力。喜会吉星化解束缚，忌会煞星增加困难。五行属火，化气为索，象征束缚和困难。在斗分中属于岁前12神，流动属性，阳性能量，主导流年中的束缚和官司。适合从事法律、司法或束缚相关职业，但需注意避免官司和困境。",
"官符": "凶星吉星：凶星\n斗分：岁前12神（流动）\n阴阳：阳\n五行：金\n化气：符\n能量：官非、法律和纪律\n职业：法律、公务员、纪律行业\n职务：官符、官非者\n别号：官符星\n解释：官符星代表官非、法律和纪律。坐命宫时，易涉官非，但具法律知识。喜会吉星化解官非，忌会煞星增加法律问题。五行属金，化气为符，象征锐利和官非。在斗分中属于岁前12神，流动属性，阳性能量，主导流年中的官非和法律。适合从事法律、公务或纪律职业，但需注意避免官司和冲突。",
"龙德": "凶星吉星：吉星\n斗分：岁前12神（流动）\n阴阳：阳\n五行：木\n化气：德\n能量：贵人、道德和好运\n职业：贵人行业、道德工作、公益\n职务：龙德、贵人者\n别号：龙德星\n解释：龙德星代表贵人、道德和好运。坐命宫时，得贵人助，有道德，但易被动。喜会吉星增强贵人运，忌会煞星减少好运。五行属木，化气为德，象征生长和道德。在斗分中属于岁前12神，流动属性，阳性能量，主导流年中的贵人和好运。适合从事贵人相关、道德或公益职业，但需注意避免被动和依赖。",
"白虎": "凶星吉星：凶星\n斗分：岁前12神（流动）\n阴阳：阴\n五行：金\n化气：虎\n能量：凶灾、意外和压力\n职业：应急行业、安全、医疗\n职务：白虎、凶灾者\n别号：白虎星\n解释：白虎星代表凶灾、意外和压力。坐命宫时，易有凶事，但具抵抗力。喜会吉星化解凶灾，忌会煞星增加压力。五行属金，化气为虎，象征锐利和凶灾。在斗分中属于岁前12神，流动属性，阴性能量，主导流年中的凶灾和意外。适合从事应急、安全或医疗职业，但需注意避免危险和压力。",
"天德": "凶星吉星：吉星\n斗分：岁前12神（流动）\n阴阳：阳\n五行：土\n化气：德\n能量：道德、解厄和贵人\n职业：道德行业、公益、贵人工作\n职务：天德、道德者\n别号：天德星\n解释：天德星代表道德、解厄和贵人。坐命宫时，有道德感，易解厄，但易理想化。喜会吉星增强道德，忌会煞星减少解厄。五行属土，化气为德，象征稳定和道德。在斗分中属于岁前12神，流动属性，阳性能量，主导流年中的道德和解厄。适合从事道德、公益或贵人相关职业，但需注意避免理想化和被动。",
"吊客": "凶星吉星：凶星\n斗分：岁前12神（流动）\n阴阳：阴\n五行：金\n化气：吊\n能量：丧事、悲伤和损失\n职业：殡葬、心理咨询、宗教\n职务：吊客、悲伤者\n别号：吊客星\n解释：吊客星代表丧事、悲伤和损失。坐命宫时，易有丧事，但具同情心。喜会吉星化解悲伤，忌会煞星增加损失。五行属金，化气为吊，象征锐利和悲伤。在斗分中属于岁前12神，流动属性，阴性能量，主导流年中的悲伤和损失。适合从事殡葬、心理或宗教职业，但需注意避免过度悲伤和损失。",
"长生": "凶星吉星：吉星\n斗分：长生十二神（固定）\n阴阳：阳\n五行：木\n化气：生\n能量：生长、开端、活力\n职业：创业、教育、生长行业\n职务：长生、生长者\n别号：长生星\n解释：长生星象征生长、开端、活力。坐命宫时，生命力强，事业起步顺利，但易冲动。喜会吉星增强生长，忌会煞星导致过早衰退。五行属木，化气为生，象征生长和开始。在斗分中属于长生十二神，固定属性，阳性能量，主导生命力和开端。适合从事创业、教育或生长相关职业，但需注意避免冲动和过早扩张。",
"沐浴": "凶星吉星：中性星\n斗分：长生十二神（固定）\n阴阳：阴\n五行：水\n化气：沐\n能量：桃花、享受、暴露\n职业：娱乐、艺术、休闲行业\n职务：沐浴、享受者\n别号：沐浴星\n解释：沐浴星象征桃花、享受、暴露。坐命宫时，异性缘佳，爱享受，但易沉迷。喜会吉星转化桃花，忌会煞星导致感情纠纷。五行属水，化气为沐，象征流动和享受。在斗分中属于长生十二神，固定属性，阴性能量，主导桃花和享受。适合从事娱乐、艺术或休闲职业，但需注意避免沉迷和暴露。",
"冠带": "凶星吉星：吉星\n斗分：长生十二神（固定）\n阴阳：阳\n五行：木\n化气：冠\n能量：成长、学习、准备\n职业：教育、学习、准备行业\n职务：冠带、成长者\n别号：冠带星\n解释：冠带星象征成长、学习、准备。坐命宫时，好学上进，易得教育机会，但易压力大。喜会文星增强学习，忌会煞星导致成长受阻。五行属木，化气为冠，象征生长和准备。在斗分中属于长生十二神，固定属性，阳性能量，主导成长和学习。适合从事教育、学习或准备职业，但需注意避免压力过大。",
"临官": "凶星吉星：吉星\n斗分：长生十二神（固定）\n阴阳：阳\n五行：木\n化气：临\n能量：事业、成就、地位\n职业：事业、管理、成就行业\n职务：临官、成就者\n别号：临官星\n解释：临官星象征事业、成就、地位。坐命宫时，事业心强，易获地位，但易劳累。喜会吉星增强事业，忌会煞星导致官非。五行属木，化气为临，象征生长和成就。在斗分中属于长生十二神，固定属性，阳性能量，主导事业和地位。适合从事事业、管理或成就相关职业，但需注意避免劳累和官非。",
"帝旺": "凶星吉星：吉星\n斗分：长生十二神（固定）\n阴阳：阳\n五行：火\n化气：帝\n能量：巅峰、强大、成功\n职业：领导、巅峰行业、成功领域\n职务：帝旺、成功者\n别号：帝旺星\n解释：帝旺星象征巅峰、强大、成功。坐命宫时，运势强盛，自信满满，但易过度。喜会吉星维持巅峰，忌会煞星导致盛极而衰。五行属火，化气为帝，象征热情和成功。在斗分中属于长生十二神，固定属性，阳性能量，主导巅峰和成功。适合从事领导、巅峰或成功职业，但需注意避免过度自信和衰退。",
"衰": "凶星吉星：凶星\n斗分：长生十二神（固定）\n阴阳：阴\n五行：土\n化气：衰\n能量：衰落、减弱、疲惫\n职业：休息、调整、衰退行业\n职务：衰、衰落者\n别号：衰星\n解释：衰星象征衰落、减弱、疲惫。坐命宫时，运势下降，易感疲惫，但具反思。喜会吉星化解衰落，忌会煞星加速衰退。五行属土，化气为衰，象征稳定和衰落。在斗分中属于长生十二神，固定属性，阴性能量，主导衰落和反思。适合从事休息、调整或衰退相关职业，但需注意避免疲惫和放弃。",
"病": "凶星吉星：凶星\n斗分：长生十二神（固定）\n阴阳：阴\n五行：土\n化气：病\n能量：疾病、问题、弱点\n职业：医疗、护理、问题解决\n职务：病、健康者\n别号：病星\n解释：病星象征疾病、问题、弱点。坐命宫时，健康易出问题，但具治疗意识。喜会吉星化解疾病，忌会煞星加重病情。五行属土，化气为病，象征稳定和疾病。在斗分中属于长生十二神，固定属性，阴性能量，主导疾病和弱点。适合从事医疗、护理或问题解决职业，但需注意避免健康问题和忽视。",
"死": "凶星吉星：凶星\n斗分：长生十二神（固定）\n阴阳：阴\n五行：土\n化气：死\n能量：结束、静止、死亡\n职业：结束行业、宗教、哲学\n职务：死、结束者\n别号：死星\n解释：死星象征结束、静止、死亡。坐命宫时，易有结束事，但具重生力。喜会吉星转化结束，忌会煞星导致绝望。五行属土，化气为死，象征稳定和结束。在斗分中属于长生十二神，固定属性，阴性能量，主导结束和静止。适合从事结束、宗教或哲学职业，但需注意避免绝望和消极。",
"墓": "凶星吉星：中性星\n斗分：长生十二神（固定）\n阴阳：阴\n五行：土\n化气：墓\n能量：收藏、隐藏、积累\n职业：仓储、收藏、积累行业\n职务：墓、收藏者\n别号：墓星\n解释：墓星象征收藏、隐藏、积累。坐命宫时，善积累财富，但易保守。喜会吉星增强收藏，忌会煞星导致破耗。五行属土，化气为墓，象征稳定和收藏。在斗分中属于长生十二神，固定属性，阴性能量，主导收藏和积累。适合从事仓储、收藏或积累职业，但需注意避免保守和破财。",
"绝": "凶星吉星：凶星\n斗分：长生十二神（固定）\n阴阳：阳\n五行：金\n化气：绝\n能量：灭绝、低谷、结束\n职业：低谷行业、转变、重生\n职务：绝、低谷者\n别号：绝星\n解释：绝星象征灭绝、低谷、结束。坐命宫时，运势低谷，易有损失，但具潜力。喜会吉星转化绝地，忌会煞星导致一蹶不振。五行属金，化气为绝，象征锐利和灭绝。在斗分中属于长生十二神，固定属性，阳性能量，主导低谷和结束。适合从事低谷、转变或重生职业，但需注意避免绝望和损失。",
"胎": "凶星吉星：吉星\n斗分：长生十二神（固定）\n阴阳：阴\n五行：水\n化气：胎\n能量：孕育、开始、潜在\n职业：创业、孕育行业、计划\n职务：胎、孕育者\n别号：胎星\n解释：胎星象征孕育、开始、潜在。坐命宫时，有新计划，易有开始，但易不显。喜会吉星增强孕育，忌会煞星导致流产。五行属水，化气为胎，象征流动和潜在。在斗分中属于长生十二神，固定属性，阴性能量，主导孕育和开始。适合从事创业、孕育或计划职业，但需注意避免流产和失败。",
"养": "凶星吉星：吉星\n斗分：长生十二神（固定）\n阴阳：阳\n五行：土\n化气：养\n能量：养育、成长、培养\n职业：教育、培养、成长行业\n职务：养、养育者\n别号：养星\n解释：养星象征养育、成长、培养。坐命宫时，善培养能力，易得支持，但易依赖。喜会吉星增强养育，忌会煞星导致成长缓慢。五行属土，化气为养，象征稳定和养育。在斗分中属于长生十二神，固定属性，阳性能量，主导养育和成长。适合从事教育、培养或成长职业，但需注意避免依赖和缓慢。",
"运昌": "凶星吉星：吉星\n斗分：流曜（大限）\n阴阳：阳\n五行：金\n化气：科\n能量：文学、才华、考试\n职业：教育、文学、考试行业\n职务：运昌、才华者\n别号：大限文昌星\n解释：运昌是大限文昌星，代表大限期间的文学、才华和考试运势。增强学习、沟通和创作能力，但易理想化。喜会文星增强才华，忌会煞星导致文途受阻。五行属金，化气为科，象征锐利和智慧。在斗分中属于流曜系，大限属性，阳性能量，主导大限中的学习和文化。适合从事教育、文学或考试相关职业，但需注意避免脱离实际。",
"流昌": "凶星吉星：吉星\n斗分：流曜（流年）\n阴阳：阳\n五行：金\n化气：科\n能量：文学、才华、考试\n职业：教育、文学、考试行业\n职务：流昌、才华者\n别号：流年文昌星\n解释：流昌是流年文昌星，代表流年期间的文学、才华和考试运势。影响当年学习、文书和沟通，但易有波折。喜会文星增强才华，忌会煞星减少灵感。五行属金，化气为科，象征锐利和智慧。在斗分中属于流曜系，流年属性，阳性能量，主导流年中的学习和沟通。适合从事教育、文学或考试职业，但需注意避免波折和阻碍。",
"运曲": "凶星吉星：吉星\n斗分：流曜（大限）\n阴阳：阴\n五行：水\n化气：科\n能量：艺术、口才、智慧\n职业：艺术、口才、智慧行业\n职务：运曲、艺术者\n别号：大限文曲星\n解释：运曲是大限文曲星，代表大限期间的艺术、口才和智慧运势。增强艺术表达和交际，但易浮华。喜会文星增强艺术，忌会煞星导致是非。五行属水，化气为科，象征流动和创意。在斗分中属于流曜系，大限属性，阴性能量，主导大限中的艺术和表达。适合从事艺术、口才或智慧职业，但需注意避免浮夸和是非。",
"流曲": "凶星吉星：吉星\n斗分：流曜（流年）\n阴阳：阴\n五行：水\n化气：科\n能量：艺术、口才、智慧\n职业：艺术、口才、智慧行业\n职务：流曲、艺术者\n别号：流年文曲星\n解释：流曲是流年文曲星，代表流年期间的艺术、口才和智慧运势。影响当年艺术、口才和灵感，但易有波动。喜会文星增强智慧，忌会煞星减少表达。五行属水，化气为科，象征流动和创意。在斗分中属于流曜系，流年属性，阴性能量，主导流年中的艺术和灵感。适合从事艺术、口才或智慧职业，但需注意避免波动和表达受阻。",
"运魁": "凶星吉星：吉星\n斗分：流曜（大限）\n阴阳：阳\n五行：火\n化气：贵\n能量：男性贵人、机遇、帮助\n职业：贵人行业、机遇工作、男性领域\n职务：运魁、贵人者\n别号：大限天魁星\n解释：运魁是大限天魁星，代表大限期间的男性贵人运势。增强机遇和帮助，但易被动。喜会吉星增强贵人运，忌会煞星减少机遇。五行属火，化气为贵，象征热情和机遇。在斗分中属于流曜系，大限属性，阳性能量，主导大限中的男性贵人和机遇。适合从事贵人相关、机遇或男性领域职业，但需注意避免被动等待。",
"流魁": "凶星吉星：吉星\n斗分：流曜（流年）\n阴阳：阳\n五行：火\n化气：贵\n能量：男性贵人、机遇、帮助\n职业：贵人行业、机遇工作、男性领域\n职务：流魁、贵人者\n别号：流年天魁星\n解释：流魁是流年天魁星，代表流年期间的男性贵人运势。影响当年贵人相助，但易依赖。喜会吉星增强帮助，忌会煞星导致延迟。五行属火，化气为贵，象征热情和机遇。在斗分中属于流曜系，流年属性，阳性能量，主导流年中的男性贵人和帮助。适合从事贵人相关、机遇或男性领域职业，但需注意避免依赖和延迟。",
"运钺": "凶星吉星：吉星\n斗分：流曜（大限）\n阴阳：阴\n五行：火\n化气：贵\n能量：女性贵人、机遇、帮助\n职业：贵人行业、机遇工作、女性领域\n职务：运钺、贵人者\n别号：大限天钺星\n解释：运钺是大限天钺星，代表大限期间的女性贵人运势。增强女性帮助和机遇，但易犹豫。喜会吉星增强贵人运，忌会煞星减少支持。五行属火，化气为贵，象征温暖和支持。在斗分中属于流曜系，大限属性，阴性能量，主导大限中的女性贵人和机遇。适合从事贵人相关、机遇或女性领域职业，但需注意避免犹豫和错过。",
"流钺": "凶星吉星：吉星\n斗分：流曜（流年）\n阴阳：阴\n五行：火\n化气：贵\n能量：女性贵人、机遇、帮助\n职业：贵人行业、机遇工作、女性领域\n职务：流钺、贵人者\n别号：流年天钺星\n解释：流钺是流年天钺星，代表流年期间的女性贵人运势。影响当年女性贵人，但易有烦恼。喜会吉星增强机遇，忌会煞星导致犹豫。五行属火，化气为贵，象征温暖和支持。在斗分中属于流曜系，流年属性，阴性能量，主导流年中的女性贵人和帮助。适合从事贵人相关、机遇或女性领域职业，但需注意避免烦恼和犹豫。",
"运禄": "凶星吉星：吉星\n斗分：流曜（大限）\n阴阳：阴\n五行：土\n化气：禄\n能量：财富、稳定、积累\n职业：财富行业、稳定工作、积累领域\n职务：运禄、财富者\n别号：大限禄存星\n解释：运禄是大限禄存星，代表大限期间的财富和稳定运势。增强财运和积累，但易保守。喜会主星增强财富，忌会煞星导致破财。五行属土，化气为禄，象征积累和稳定。在斗分中属于流曜系，大限属性，阴性能量，主导大限中的财富和积累。适合从事财富、稳定或积累职业，但需注意避免保守和破财。",
"流禄": "凶星吉星：吉星\n斗分：流曜（流年）\n阴阳：阴\n五行：土\n化气：禄\n能量：财富、稳定、积累\n职业：财富行业、稳定工作、积累领域\n职务：流禄、财富者\n别号：流年禄存星\n解释：流禄是流年禄存星，代表流年期间的财富和稳定运势。影响当年财运和机遇，但易有破耗。喜会吉星增强稳定，忌会煞星增加损失。五行属土，化气为禄，象征积累和稳定。在斗分中属于流曜系，流年属性，阴性能量，主导流年中的财富和机遇。适合从事财富、稳定或积累职业，但需注意避免破耗和损失。",
"运羊": "凶星吉星：凶星\n斗分：流曜（大限）\n阴阳：阳\n五行：金\n化气：刑\n能量：冲突、伤害、冲动\n职业：冲突行业、危险工作、行动领域\n职务：运羊、冲突者\n别号：大限擎羊星\n解释：运羊是大限擎羊星，代表大限期间的冲突和伤害运势。增加冲动和风险，但具突破力。喜会吉星化解冲突，忌会主星增加伤害。五行属金，化气为刑，象征锐利和伤害。在斗分中属于流曜系，大限属性，阳性能量，主导大限中的冲突和行动。适合从事冲突、危险或行动职业，但需注意避免冲动和伤害。",
"流羊": "凶星吉星：凶星\n斗分：流曜（流年）\n阴阳：阳\n五行：金\n化气：刑\n能量：冲突、伤害、冲动\n职业：冲突行业、危险工作、行动领域\n职务：流羊、冲突者\n别号：流年擎羊星\n解释：流羊是流年擎羊星，代表流年期间的冲突和伤害运势。影响当年冲突和意外，但具行动力。喜会吉星化解风险，忌会煞星导致纠纷。五行属金，化气为刑，象征锐利和伤害。在斗分中属于流曜系，流年属性，阳性能量，主导流年中的冲突和意外。适合从事冲突、危险或行动职业，但需注意避免纠纷和伤害。",
"运陀": "凶星吉星：凶星\n斗分：流曜（大限）\n阴阳：阴\n五行：金\n化气：忌\n能量：拖延、纠缠、反复\n职业：拖延行业、持久工作、研究领域\n职务：运陀、拖延者\n别号：大限陀罗星\n解释：运陀是大限陀罗星，代表大限期间的拖延和纠缠运势。增加阻碍和烦恼，但具耐力。喜会吉星化解拖延，忌会主星增加阻碍。五行属金，化气为忌，象征阻碍和反复。在斗分中属于流曜系，大限属性，阴性能量，主导大限中的拖延和纠缠。适合从事拖延、持久或研究职业，但需注意避免阻碍和烦恼。",
"流陀": "凶星吉星：凶星\n斗分：流曜（流年）\n阴阳：阴\n五行：金\n化气：忌\n能量：拖延、纠缠、反复\n职业：拖延行业、持久工作、研究领域\n职务：流陀、拖延者\n别号：流年陀罗星\n解释：流陀是流年陀罗星，代表流年期间的拖延和纠缠运势。影响当年拖延和反复，但具坚持。喜会吉星化解纠缠，忌会煞星增加烦恼。五行属金，化气为忌，象征阻碍和反复。在斗分中属于流曜系，流年属性，阴性能量，主导流年中的拖延和反复。适合从事拖延、持久或研究职业，但需注意避免烦恼和浪费时间。",
"运马": "凶星吉星：中性星\n斗分：流曜（大限）\n阴阳：阳\n五行：火\n化气：动\n能量：移动、旅行、变化\n职业：旅行行业、变动工作、移动领域\n职务：运马、移动者\n别号：大限天马星\n解释：运马是大限天马星，代表大限期间的移动和变化运势。增强旅行和变动，但易不稳定。喜会禄存增强移动财，忌会煞星导致奔波。五行属火，化气为动，象征速度和变化。在斗分中属于流曜系，大限属性，阳性能量，主导大限中的旅行和变动。适合从事旅行、变动或移动职业，但需注意避免奔波和不安定。",
"流马": "凶星吉星：中性星\n斗分：流曜（流年）\n阴阳：阳\n五行：火\n化气：动\n能量：移动、旅行、变化\n职业：旅行行业、变动工作、移动领域\n职务：流马、移动者\n别号：流年天马星\n解释：流马是流年天马星，代表流年期间的移动和变化运势。影响当年奔波和机遇，但易劳累。喜会吉星增强变化，忌会煞星导致不稳定。五行属火，化气为动，象征速度和变化。在斗分中属于流曜系，流年属性，阳性能量，主导流年中的移动和变化。适合从事旅行、变动或移动职业，但需注意避免劳累和不安。",
"运鸾": "凶星吉星：吉星\n斗分：流曜（大限）\n阴阳：阴\n五行：水\n化气：喜\n能量：婚姻、喜庆、感情\n职业：婚庆行业、感情工作、喜庆领域\n职务：运鸾、喜庆者\n别号：大限红鸾星\n解释：运鸾是大限红鸾星，代表大限期间的婚姻和感情运势。增强桃花和喜庆，但易早恋。喜会吉星增强婚姻，忌会煞星导致感情波折。五行属水，化气为喜，象征流动和喜悦。在斗分中属于流曜系，大限属性，阴性能量，主导大限中的感情和喜庆。适合从事婚庆、感情或喜庆职业，但需注意避免早恋和波折。",
"流鸾": "凶星吉星：吉星\n斗分：流曜（流年）\n阴阳：阴\n五行：水\n化气：喜\n能量：婚姻、喜庆、感情\n职业：婚庆行业、感情工作、喜庆领域\n职务：流鸾、喜庆者\n别号：流年红鸾星\n解释：流鸾是流年红鸾星，代表流年期间的婚姻和感情运势。影响当年感情和喜事，但易波折。喜会吉星增强喜庆，忌会煞星减少快乐。五行属水，化气为喜，象征流动和喜悦。在斗分中属于流曜系，流年属性，阴性能量，主导流年中的感情和喜事。适合从事婚庆、感情或喜庆职业，但需注意避免波折和失望。",
"运喜": "凶星吉星：吉星\n斗分：流曜（大限）\n阴阳：阳\n五行：水\n化气：喜\n能量：喜悦、好事、生育\n职业：喜庆行业、生育工作、快乐领域\n职务：运喜、快乐者\n别号：大限天喜星\n解释：运喜是大限天喜星，代表大限期间的喜悦和好事运势。增强快乐和生育，但易冲动。喜会吉星增强好事，忌会煞星导致过度。五行属水，化气为喜，象征流动和欢乐。在斗分中属于流曜系，大限属性，阳性能量，主导大限中的喜悦和生育。适合从事喜庆、生育或快乐职业，但需注意避免冲动和过度。",
"流喜": "凶星吉星：吉星\n斗分：流曜（流年）\n阴阳：阳\n五行：水\n化气：喜\n能量：喜悦、好事、生育\n职业：喜庆行业、生育工作、快乐领域\n职务：流喜、快乐者\n别号：流年天喜星\n解释：流喜是流年天喜星，代表流年期间的喜悦和好事运势。影响当年好事和心情，但易浮夸。喜会吉星增强喜悦，忌会煞星减少好运。五行属水，化气为喜，象征流动和欢乐。在斗分中属于流曜系，流年属性，阳性能量，主导流年中的喜悦和好事。适合从事喜庆、生育或快乐职业，但需注意避免浮夸和失望。",
"运姚": "凶星吉星：凶星（带桃花）\n斗分：流曜（大限）\n阴阳：阴\n五行：水\n化气：姚\n能量：桃花、魅力和感情\n职业：娱乐业、艺术、社交\n职务：运姚、魅力者\n别号：大限天姚星\n解释：运姚是大限天姚星，代表大限期间的桃花和魅力运势。增强感情和吸引力，但易滥情。喜会吉星转化魅力，忌会煞星导致感情纠纷。五行属水，化气为姚，象征流动和魅力。在斗分中属于流曜系，大限属性，阴性能量，主导大限中的感情和桃花。适合从事娱乐、艺术或社交职业，但需注意避免滥情和纠纷。",
"流姚": "凶星吉星：凶星（带桃花）\n斗分：流曜（流年）\n阴阳：阴\n五行：水\n化气：姚\n能量：桃花、魅力和感情\n职业：娱乐业、艺术、社交\n职务：流姚、魅力者\n别号：流年天姚星\n解释：流姚是流年天姚星，代表流年期间的桃花和魅力运势。影响当年桃花和艳遇，但易纠纷。喜会吉星增强吸引力，忌会煞星导致沉迷。五行属水，化气为姚，象征流动和魅力。在斗分中属于流曜系，流年属性，阴性能量，主导流年中的桃花和艳遇。适合从事娱乐、艺术或社交职业，但需注意避免纠纷和沉迷。",
"运刑": "凶星吉星：凶星\n斗分：流曜（大限）\n阴阳：阳\n五行：金\n化气：刑\n能量：法律、纪律和惩罚\n职业：法律、纪律行业、惩罚工作\n职务：运刑、执法者\n别号：大限天刑星\n解释：运刑是大限天刑星，代表大限期间的法律和纪律运势。增强正义感，但易涉官司。喜会吉星增强纪律，忌会煞星导致法律问题。五行属金，化气为刑，象征锐利和惩罚。在斗分中属于流曜系，大限属性，阳性能量，主导大限中的法律和纪律。适合从事法律、纪律或惩罚职业，但需注意避免官司和冲突。",
"流刑": "凶星吉星：凶星\n斗分：流曜（流年）\n阴阳：阳\n五行：金\n化气：刑\n能量：法律、纪律和惩罚\n职业：法律、纪律行业、惩罚工作\n职务：流刑、执法者\n别号：流年天刑星\n解释：流刑是流年天刑星，代表流年期间的法律和纪律运势。影响当年法律问题，但具警示。喜会吉星化解官非，忌会煞星增加冲突。五行属金，化气为刑，象征锐利和惩罚。在斗分中属于流曜系，流年属性，阳性能量，主导流年中的法律和纪律。适合从事法律、纪律或惩罚职业，但需注意避免冲突和官司。",
"运解": "凶星吉星：吉星\n斗分：流曜（大限）\n阴阳：阳\n五行：木\n化气：解\n能量：解厄、化解和 缓解\n职业：医疗、咨询、化解行业\n职务：运解、化解者\n别号：大限解神星\n解释：运解是大限解神星，代表大限期间的解厄运势。增强化解困难能力，但易依赖。喜会吉星增强解厄，忌会煞星减少帮助。五行属木，化气为解，象征生长和化解。在斗分中属于流曜系，大限属性，阳性能量，主导大限中的解厄和帮助。适合从事医疗、咨询或化解职业，但需注意避免依赖和被动。",
"流解": "凶星吉星：吉星\n斗分：流曜（流年）\n阴阳：阳\n五行：木\n化气：解\n能量：解厄、化解和 缓解\n职业：医疗、咨询、化解行业\n职务：流解、化解者\n别号：流年解神星\n解释：流解是流年解神星，代表流年期间的解厄运势。影响当年逢凶化吉，但易有延迟。喜会吉星增强化解，忌会煞星导致困难。五行属木，化气为解，象征生长和化解。在斗分中属于流曜系，流年属性，阳性能量，主导流年中的解厄和化解。适合从事医疗、咨询或化解职业，但需注意避免延迟和困难。",
"运耗": "凶星吉星：凶星\n斗分：流曜（大限）\n阴阳：阳\n五行：火\n化气：耗\n能量：破财、消耗和损失\n职业：金融、保险、风险管理\n职务：运耗、损失者\n别号：大限大耗星\n解释：运耗是大限大耗星，代表大限期间的破财运势。增加损失风险，但具节俭意识。喜会吉星化解损失，忌会煞星增加消耗。五行属火，化气为耗，象征爆发和损失。在斗分中属于流曜系，大限属性，阳性能量，主导大限中的破财和消耗。适合从事金融、保险或风险管理职业，但需注意避免破财和浪费。",
"流耗": "凶星吉星：凶星\n斗分：流曜（流年）\n阴阳：阳\n五行：火\n化气：耗\n能量：破财、消耗和损失\n职业：金融、保险、风险管理\n职务：流耗、损失者\n别号：流年大耗星\n解释：流耗是流年大耗星，代表流年期间的破财运势。影响当年破财和消耗，但具警示。喜会吉星增强节俭，忌会煞星导致大损失。五行属火，化气为耗，象征爆发和损失。在斗分中属于流曜系，流年属性，阳性能量，主导流年中的破财和消耗。适合从事金融、保险或风险管理职业，但需注意避免大损失和浪费。",
"运符": "凶星吉星：凶星\n斗分：流曜（大限）\n阴阳：阴\n五行：水\n化气：病\n能量：疾病、健康问题\n职业：医疗、护理、健康行业\n职务：运符、健康者\n别号：大限病符星\n解释：运符是大限病符星，代表大限期间的疾病运势。增加健康问题，但具保健意识。喜会吉星化解疾病，忌会煞星增加健康问题。五行属水，化气为病，象征流动和疾病。在斗分中属于流曜系，大限属性，阴性能量，主导大限中的疾病和健康。适合从事医疗、护理或健康职业，但需注意避免病痛和忽视。",
"流符": "凶星吉星：凶星\n斗分：流曜（流年）\n阴阳：阴\n五行：水\n化气：病\n能量：疾病、健康问题\n职业：医疗、护理、健康行业\n职务：流符、健康者\n别号：流年病符星\n解释：流符是流年病符星，代表流年期间的疾病运势。影响当年健康和治疗，但易有波折。喜会吉星增强保健，忌会煞星导致病痛。五行属水，化气为病，象征流动和疾病。在斗分中属于流曜系，流年属性，阴性能量，主导流年中的健康和治疗。适合从事医疗、护理或健康职业，但需注意避免波折和病痛。",
"庙": "凶星吉星：无\n斗分：无\n阴阳：无\n五行：无\n化气：无\n能量：无\n职业：无\n职务：无\n别号：无\n解释：庙是亮度的最高等级，表示星曜力量发挥最充分。吉星更吉，凶星不凶，星曜特质显著，对命宫影响极强。坐命宫时，星曜优点突出，缺点减弱，易成功。",
"旺": "凶星吉星：无\n斗分：无\n阴阳：无\n五行：无\n化气：无\n能量：无\n职业：无\n职务：无\n别号：无\n解释：旺是亮度次高等级，表示星曜力量发挥良好。吉星吉，凶星减弱，星曜特质明显，对命宫影响强。坐命宫时，星曜优点明显，缺点可控，易有成就。",
"得": "凶星吉星：无\n斗分：无\n阴阳：无\n五行：无\n化气：无\n能量：无\n职业：无\n职务：无\n别号：无\n解释：得是亮度中等等级，表示星曜力量发挥正常。吉星尚吉，凶星中性，星曜特质适中，对命宫影响一般。坐命宫时，星曜优点一般，缺点可见，需努力。",
"利": "凶星吉星：无\n斗分：无\n阴阳：无\n五行：无\n化气：无\n能量：无\n职业：无\n职务：无\n别号：无\n解释：利是亮度稍好等级，表示星曜力量发挥有利。吉星有益，凶星影响小，星曜特质稍显，对命宫影响较轻。坐命宫时，星曜优点稍显，缺点轻微，需把握。",
"平": "凶星吉星：无\n斗分：无\n阴阳：无\n五行：无\n化气：无\n能量：无\n职业：无\n职务：无\n别号：无\n解释：平是亮度平常等级，表示星曜力量发挥一般。吉星力量平，凶星力量平，星曜特质不显，对命宫影响微弱。坐命宫时，星曜优点不显，缺点不显，需借助他星。",
"不": "凶星吉星：无\n斗分：无\n阴阳：无\n五行：无\n化气：无\n能量：无\n职业：无\n职务：无\n别号：无\n解释：不是亮度不稳定等级，表示星曜力量发挥不定。吉星力量减，凶星力量增，星曜特质波动，对命宫影响不稳定。坐命宫时，星曜优点不定，缺点易显，需谨慎。",
"陷": "凶星吉星：无\n斗分：无\n阴阳：无\n五行：无\n化气：无\n能量：无\n职业：无\n职务：无\n别号：无\n解释：陷是亮度最低等级，表示星曜力量发挥最弱。吉星无力，凶星更凶，星曜特质受阻，对命宫影响负面。坐命宫时，星曜优点难显，缺点突出，易有困难。",
"禄": "凶星吉星：吉星\n斗分：四化\n阴阳：阳\n五行：土\n化气：禄\n能量：财富、机遇、顺利\n职业：财富行业、机遇工作、顺利领域\n职务：禄、财富者\n别号：化禄\n解释：化禄是四化之一，代表财富、机遇、顺利、收获、人缘和福气。具有增加、扩张的意义，能带来好处和利益，增强星曜的正面特质。坐命宫时，易得财、遇贵人，但过度易导致浪费或依赖。喜会吉星增强福气，忌会煞星减少收获。五行属土，化气为禄，象征积累和顺利。",
"权": "凶星吉星：吉星\n斗分：四化\n阴阳：阳\n五行：金\n化气：权\n能量：权力、地位、控制\n职业：权力行业、地位工作、控制领域\n职务：权、权力者\n别号：化权\n解释：化权是四化之一，代表权力、地位、控制、能力、决断和竞争。具有巩固、稳定的意义，能增强权威和领导力。坐命宫时，易掌权、有决断，但过度易导致霸道或冲突。喜会吉星增强权威，忌会煞星导致权力斗争。五行属金，化气为权，象征锐利和控制。",
"科": "凶星吉星：吉星\n斗分：四化\n阴阳：阴\n五行：水\n化气：科\n能量：名声、智慧、贵人\n职业：名声行业、智慧工作、贵人领域\n职务：科、名声者\n别号：化科\n解释：化科是四化之一，代表名声、智慧、贵人、考试、文化和艺术。具有化解、缓和的意义，能带来名誉和帮助。坐命宫时，易有名声、遇贵人，但过度易导致虚荣或压力。喜会文星增强智慧，忌会煞星减少名誉。五行属水，化气为科，象征流动和智慧。",
"忌": "凶星吉星：凶星\n斗分：四化\n阴阳：阴\n五行：水\n化气：忌\n能量：阻碍、挑战、变化\n职业：阻碍行业、挑战工作、变化领域\n职务：忌、阻碍者\n别号：化忌\n解释：化忌是四化之一，代表阻碍、挑战、变化、损失、烦恼和是非。具有减少、收缩的意义，能导致困难和压力，但也能激发努力和反思。坐命宫时，易有阻碍、遇挑战，但过度易导致损失或烦恼。喜会吉星化解阻碍，忌会煞星增加困难。五行属水，化气为忌，象征流动和阻碍。"
}